Repository: tibolpol/sealgood
Catalog: locale/*/LC_MESSAGES/sealgood.po
Languages: es, fr, pt

source: Document signing and timestamping via
es: Firma y sellado temporal de documentos mediante
fr: Signature et horodatage de documents via
pt: Assinatura e carimbo do tempo de documentos via

source: Usage
es: Uso
fr: Utilisation
pt: Utilização

source: COMMANDS
es: COMANDOS
fr: COMMANDES
pt: COMANDOS

source: Generate a new password-protected ed25519 key pair
es: Genera un nuevo par de claves ed25519 protegido por contraseña
fr: Génère une nouvelle paire de clés ed25519 protégée par mot de passe
pt: Gerar um novo par de chaves ed25519 protegido por senha

source: Show this help
es: Mostrar esta ayuda
fr: Affiche cette aide
pt: Mostrar esta ajuda

source: Extract original content without SEALGOOD tags
es: Extraer contenido original sin etiquetas SEALGOOD
fr: Extrait le contenu original sans les balises SEALGOOD
pt: Extrair conteúdo original sem tags SEALGOOD

source: Inject SealGood payload into PDF, HTML or PEM file
es: Inyectar payload SealGood en archivos PDF, HTML o PEM
fr: Injecte le payload SealGood dans un fichier PDF, HTML ou PEM
pt: Injetar payload SealGood em arquivo PDF, HTML ou PEM

source: Timestamp a document via trusted third party (TSA)
es: Sellar temporalmente un documento mediante tercero de confianza (TSA)
fr: Horodate un document via un tiers de confiance (TSA)
pt: Carimbar documento via terceira parte confiável (TSA)

source: Sign a document with your private key
es: Firmar un documento con tu clave privada
fr: Signe un document avec votre clé privée
pt: Assinar documento com sua chave privada

source: Verify document signature and timestamp
es: Verificar firma y sello temporal del documento
fr: Vérifie la signature et l'horodatage d'un document
pt: Verificar assinatura e carimbo do tempo do documento

source: Commands compose into an implicitly ordered pipeline
es: Los comandos forman un pipeline ordenado implícitamente
fr: Les commandes se composent en pipeline implicitement ordonné
pt: Comandos compõem um pipeline implicitamente ordenado

source: reads data from
es: lee datos desde
fr: lit les données sur
pt: lê dados de

source: comments progress on
es: comenta progreso en
fr: commente la progression sur
pt: comenta progresso em

source: writes data to
es: escribe datos en
fr: écrit les données sur
pt: escreve dados em

source: does NEVER write/modify any file directly
pt: NUNCA escreve/modifica arquivos diretamente

source: Whenever input is a file list, the list is enumerated
fr: Quand l'entrée est une liste de fichiers, celle-ci est énumérée
pt: Quando entrada é lista de arquivos, a lista é enumerada

source: and each item is streamed to the processing pipeline
fr: et chaque élément est traité dans le pipeline de transformation
pt: e cada item é processado no pipeline

source: The output is packaged in tar+gzip format with cryptographic
fr: Le résultat est archivé au format tar+gzip avec des empreintes
pt: Saída é empacotada em formato tar+gzip com hashes

source: hashes embedded in signed/timestamped filenames
fr: cryptographiques intégrées aux noms de fichiers signés/horodatés
pt: criptográficos embutidos em nomes de arquivos assinados/carimbados

source: reads filenames from
es: lee nombres de archivo desde
fr: lit les noms de fichiers sur
pt: lê nomes de arquivos de

source: sends each file through pipeline
es: envía cada archivo a través del pipeline
fr: envoie chaque fichier au pipeline
pt: envia cada arquivo pelo pipeline

source: outputs a tar+gzip archive to
es: genera un archivo tar+gzip en
fr: écrit une archive tar+gzip sur
pt: gera arquivo tar+gzip em

source: introduces a hash into each signed or timestamped filename
es: introduce un hash en cada nombre de archivo firmado o sellado temporalmente
fr: introduit un hash dans chaque nom de fichier signé ou horodaté
pt: insere hash em cada nome de arquivo assinado ou carimbado

source: respects existing SealGood payload
es: respeta el payload SealGood existente
fr: respecte le payload SealGood déjà présent
pt: respeita payload SealGood existente

source: implicitly perform
es: realiza implícitamente
fr: opèrent implicitement
pt: executa implicitamente

source: respect existing signature/timestamp
es: respeta firma/sello temporal existente
fr: respectent une signature/horodatage déjà présente
pt: respeita assinatura/carimbo existente

source: asks private key passphrase only once
es: solicita frase de contraseña de clave privada solo una vez
fr: ne demande qu'une fois la passphrase de la clé privée
pt: pede senha da chave privada apenas uma vez

source: Examples
es: Ejemplos
fr: Exemples
pt: Exemplos

source: Files used
es: Archivos utilizados
fr: Fichiers utilisés
pt: Arquivos utilizados

source: signer private keys
es: claves privadas del firmante
fr: clés privées signataires
pt: chaves privadas do signatário

source: associated public keys
es: claves públicas asociadas
fr: clés publiques associées
pt: chaves públicas associadas

source: signer identity declaration
es: declaración de identidad del firmante
fr: déclaration d'identité du signataire
pt: declaração de identidade do signatário

source: TSA root certificate
es: certificado raíz TSA
fr: certificat racine TSA
pt: certificado raiz TSA

source: Free servlet
fr: Servlet ouverte
pt: Servlet livre

source: See also
es: Ver también
fr: Voir aussi
pt: Veja também

source: %s already exists and has non-zero size
es: %s ya existe y tiene tamaño distinto de cero
fr: %s existe déjà et a une taille non nulle
pt: %s já existe e tem tamanho não zero

source: This key will be used to sign documents, please enter signer name
es: Esta clave se usará para firmar documentos, ingrese el nombre del firmante
fr: Cette clé servira à signer des documents, mentionnez le nom du signataire
pt: Esta chave será usada para assinar documentos, informe o nome do signatário

source: You can (should) publish %s on a trusted public repository and mention its URL in %s
es: Puedes (deberías) publicar %s en un repositorio público confiable y mencionar su URL en %s
fr: Vous pouvez (devez) diffuser %s sur un référentiel public de confiance, et mentionner son URL dans %s
pt: Você pode (deve) publicar %s em repositório público confiável e mencionar sua URL em %s

source: This way your document signatures will be non-repudiable and therefore accepted
es: Así tus firmas de documentos serán irrepudiables y por lo tanto aceptadas
fr: Ainsi vos signatures de document seront non répudiables, donc acceptées
pt: Assim suas assinaturas serão irrepudiáveis e portanto aceitas

source: Private key password
es: Contraseña de clave privada
fr: Mot de passe de la clé privée
pt: Senha da chave privada

source: Hash in old filename %s doesn't match document hash
es: El hash en el nombre antiguo %s no coincide con el hash del documento
fr: Le hash de l'ancien nom %s ne correspond pas au hash du document
pt: Hash no nome antigo %s não corresponde ao hash do documento

source: File is not readable: "%s"
es: El archivo no es legible: "%s"
fr: Fichier non lisible : "%s"
pt: Arquivo não legível: "%s"

source: Too many consecutive errors: %d
es: Demasiados errores consecutivos: %d
fr: Trop d'erreurs consécutives : %d
pt: Muitos erros consecutivos: %d

source: Verification summary
es: Resumen de verificación
fr: Résumé des vérifications
pt: Resumo das verificações

source: End of verifications
es: Fin de verificaciones
fr: Fin des vérifications
pt: Fim das verificações

source: Public key
es: Clave pública
fr: Clé publique
pt: Chave pública

source: I don't know how to inject into
es: No sé cómo inyectar en
fr: Je ne sais pas injecter dans le
pt: Não sei como injetar em

source: Already timestamped
es: Ya sellado temporalmente
fr: Déjà horodaté
pt: Já carimbado

source: %s is not encrypted
es: %s no está cifrado
fr: %s non chiffrée
pt: %s não está criptografado

source: Already signed
es: Ya firmado
fr: Déjà signé
pt: Já assinado

source: Extracting verification elements
es: Extrayendo elementos de verificación
fr: Extraction des éléments de vérification
pt: Extraindo elementos de verificação

source: Original content extracted
es: Contenido original extraído
fr: Contenu original extrait
pt: Conteúdo original extraído

source: Signature not found in document
es: Firma no encontrada en el documento
fr: Signature introuvable dans le document
pt: Assinatura não encontrada no documento

source: Signature extracted and decoded
es: Firma extraída y decodificada
fr: Signature extraite et décodée
pt: Assinatura extraída e decodificada

source: Public key not found in document
es: Clave pública no encontrada en el documento
fr: Clé publique introuvable dans le document
pt: Chave pública não encontrada no documento

source: Public key extracted
es: Clave pública extraída
fr: Clé publique extraite
pt: Chave pública extraída

source: TSR not found in document
es: TSR no encontrado en el documento
fr: TSR introuvable dans le document
pt: TSR não encontrado no documento

source: TSR extracted and decoded
es: TSR extraído y decodificado
fr: TSR extrait et décodé
pt: TSR extraído e decodificado

source: TSA certificate extracted
es: Certificado TSA extraído
fr: Certificat TSA extrait
pt: Certificado TSA extraído

source: Verifying digital signature
es: Verificando firma digital
fr: Vérification de la signature numérique
pt: Verificando assinatura digital

source: Signature successfully verified
es: Firma verificada exitosamente
fr: Signature vérifiée avec succès
pt: Assinatura verificada com sucesso

source: Signature verification failed
es: Falló la verificación de firma
fr: Échec de la vérification de la signature
pt: Falha na verificação da assinatura

source: Verifying TSA timestamp
es: Verificando sello temporal TSA
fr: Vérification de l'horodatage TSA
pt: Verificando carimbo do tempo TSA

source: Timestamp successfully verified
es: Sello temporal verificado exitosamente
fr: Horodatage vérifié avec succès
pt: Carimbo do tempo verificado com sucesso

source: Timestamp verification failed
es: Falló la verificación de sello temporal
fr: Échec de la vérification de l'horodatage
pt: Falha na verificação do carimbo

source: Timestamp details
es: Detalles del sello temporal
fr: Détails de l'horodatage
pt: Detalhes do carimbo

source: Signature status
es: Estado de la firma
fr: Statut de la signature
pt: Status da assinatura

source: VALID
es: VÃLIDO
fr: VALIDE
pt: VÃLIDO

source: INVALID
es: INVÃLIDO
fr: INVALIDE
pt: INVÃLIDO

source: MISSING
es: AUSENTE
fr: ABSENT
pt: AUSENTE

source: Timestamp status
es: Estado del sello temporal
fr: Statut de l'horodatage
pt: Status do carimbo

source: Document
es: El documento
fr: Le document
pt: Documento

source: is signed, timestamped and intact
es: está firmado, sellado temporalmente e intacto
fr: est signé, horodaté et intact
pt: está assinado, carimbado e íntegro

source: is signed and intact
es: está firmado e intacto
fr: est signé et intact
pt: está assinado e íntegro

source: is timestamped and intact
es: tiene sello temporal e intacto
fr: est horodaté et intact
pt: está carimbado e íntegro

source: is neither signed nor timestamped
es: no está firmado ni sellado temporalmente
fr: n'est pas signé ni horodaté
pt: não está assinado nem carimbado

source: has been altered
es: ha sido alterado
fr: a été altéré
pt: foi alterado

source: Remaining arguments "%s" could not be processed
es: Argumentos restantes "%s" no pudieron ser procesados
fr: Les arguments restants "%s" n'ont pas pu être traités
pt: Argumentos restantes "%s" não puderam ser processados

source: The 100%% DIY Document Authenticator
es: El Autenticador de Documentos 100%% DIY
fr: L'authentificateur de documents 100%% DIY
pt: O Autenticador de Documentos 100%% DIY

source: WARNING! As with a physical document, verifying authenticity and signature is harder than signing. The key is to guarantee that the means exist, that they are freely and publicly available, and that they use recognized, documented and standard tools at each step for transparency of proof. Each step can therefore be done manually with this guide. A lightweight integration is proposed on the site
es: ADVERTENCIA: Como con un documento físico, verificar autenticidad y firma es más difícil que firmar. La clave es garantizar que los medios existan, que estén disponibles pública y gratuitamente, y que usen herramientas estándar, documentadas y reconocidas en cada paso para transparencia de prueba. Cada paso puede hacerse manualmente con esta guía. Se propone una integración ligera en el sitio
fr: AVERTISSEMENT : Comme pour un document matériel, vérifier l'authenticité et la signature est plus difficile que de signer. L'essentiel est de garantir que les moyens existent, qu'ils soient disponibles gratuitement et publiquement, et qu'ils utilisent à chaque étape des outils reconnus, documentés et standards, pour la transparence de la preuve. Chaque étape est donc réalisable à la main à l'aide de ce guide. Une intégration légère est proposée sur le site
pt: ATENÃÃO! Como com documentos físicos, verificar autenticidade e assinatura é mais difícil que assinar. O essencial é garantir que os meios existam, sejam livres e publicamente disponíveis, e usem ferramentas reconhecidas, documentadas e padrão em cada etapa para transparência da prova. Cada passo pode ser feito manualmente com este guia. Uma integração leve é proposta no site

source: Verification tools
es: Herramientas de verificación
fr: Outils de vérification
pt: Ferramentas de verificação

source: POSIX standard
es: estándar POSIX
fr: standard POSIX
pt: padrão POSIX

source: non-POSIX but recognized standard
es: no POSIX pero estándar reconocido
fr: non POSIX mais standard reconnu
pt: não-POSIX mas padrão reconhecido

source: The signed document has the following properties
es: El documento firmado tiene las siguientes propiedades
fr: Le document signé a les propriétés suivantes
pt: O documento assinado tem as seguintes propriedades

source: Signer declaration
es: Declaración del firmante
fr: Déclaration de signataire
pt: Declaração do signatário

source: Signer ed25519 public key
es: Clave pública ed25519 del firmante
fr: Clé publique ed25519 du signataire
pt: Chave pública ed25519 do signatário

source: WARNING! The readable signer declaration here could have been forged. What makes it valid is the trusted third party associated with this key (website, personal exchange, blockchain, public key sealed and published on an irrefutable address by the signer)
es: ¡ADVERTENCIA! La declaración legible del firmante pudo haber sido falsificada. Lo que la hace válida es el tercero confiable asociado a esta clave (sitio web, intercambio personal, blockchain, clave pública sellada y publicada en una dirección irrefutable por el firmante)
fr: ATTENTION ! La déclaration de signataire lisible ici pourrait avoir été forgée. Ce qui fait foi est le tiers de confiance associé à cette clé (site web, échange personnel, blockchain, clé publique scellée et publiée sur une adresse irrépudiable par le signataire)
pt: ATENÃÃO! A declaração legível do signatário aqui pode ter sido forjada. O que a valida é o terceiro confiável associado a esta chave (site, troca pessoal, blockchain, chave pública selada e publicada em endereço irrefutável pelo signatário)

source: The signature and timestamp remain valid as long as the content outside the BEGIN SEALGOOD and END SEALGOOD tags is not altered
es: La firma y sello temporal permanecen válidos mientras el contenido fuera de las etiquetas BEGIN SEALGOOD y END SEALGOOD no sea alterado
fr: La signature et l'horodatage restent valides tant que le contenu hors des balises BEGIN SEALGOOD et END SEALGOOD n'est pas altéré
pt: A assinatura e carimbo permanecem válidos enquanto conteúdo fora das tags BEGIN SEALGOOD e END SEALGOOD não for alterado

source: If verification element 4 is not a PLACEHOLDER but a base64 signature code, the signer's identity can be proven
es: Si el elemento de verificación 4 no es un PLACEHOLDER sino un código de firma base64, la identidad del firmante puede probarse
fr: Si l'élément de vérification 4 n'est pas un PLACEHOLDER mais un code de signature en base64, l'identité du signataire peut être prouvée
pt: Se elemento 4 não for PLACEHOLDER mas código de assinatura base64, a identidade do signatário pode ser provada

source: Key presentation URL, presented by the # signer as trusted, so that they cannot repudiate this signature
es: URL de presentación de clave, presentada por # el firmante como confiable, para que no pueda repudiar esta firma
fr: URL de présentation de la clé, présentée par le # signataire comme de confiance, afin que celui-ci ne fasse pas opposition à # cette signature (non répudiation)
pt: URL de apresentação da chave, apresentada pelo # signatário como confiável, para que não possa repudiar esta assinatura

source: Verification element
es: Elemento de verificación
fr: Élément de vérification
pt: Elemento de verificação

source: Signer's ed25519 public key
es: Clave pública ed25519 del firmante
fr: Clé publique ed25519 du signataire
pt: Chave pública ed25519 do signatário

source: COPY the three lines below and PASTE into file /tmp/%s
es: COPIAR las tres líneas siguientes y PEGAR en el archivo /tmp/%s
fr: COPIER trois lignes ci-dessous et COLLER dans le fichier /tmp/%s
pt: COPIE as três linhas abaixo e COLE no arquivo /tmp/%s

source: or download %s to /tmp/%s
es: o descargar %s a /tmp/%s
fr: ou télécharger %s vers /tmp/%s
pt: ou baixe %s para /tmp/%s

source: Unsigned file without payload
es: Archivo no firmado sin payload
fr: Fichier non signé sans payload
pt: Arquivo não assinado sem payload

source: just before signing
es: justo antes de firmar
fr: juste avant la signature
pt: pouco antes de assinar

source: Signature of the original file hash
es: Firma del hash original del archivo
fr: Signature du hash original du fichier
pt: Assinatura do hash original do arquivo

source: COPY the line below and PASTE into file
es: COPIAR la línea siguiente y PEGAR en el archivo
fr: COPIER la ligne ci-dessous et COLLER dans le fichier
pt: COPIE a linha abaixo e COLE no arquivo

source: Final verification
es: Verificación final
fr: Vérification finale
pt: Verificação final

source: Current file hash and validation of match using public key
es: Hash actual del archivo y validación de coincidencia # usando clave pública
fr: Hash du fichier actuel et validation de la correspondance à l'aide de la clé publique
pt: Hash atual do arquivo e validação de correspondência usando chave pública

source: Links the file hash to the private key owner's trust chain
es: Vincula el hash del archivo a la cadena de confianza del dueño de la clave privada
fr: Lie le hash du fichier à la chaîne de confiance du possesseur de laclé privée
pt: Vincula o hash do arquivo à cadeia de confiança do dono da chave privada

source: verify signature
es: verificar firma
fr: vérifier la signature
pt: verificar assinatura

source: If verification element 2 is not a PLACEHOLDER but a base64 code, the signing date can be proven
es: Si el elemento de verificación 2 no es un PLACEHOLDER sino un código base64, la fecha de firma puede probarse
fr: Si l'élément de vérification 2 n'est pas un PLACEHOLDER mais un code en base64, la date de signature peut être prouvée
pt: Se elemento 2 não for PLACEHOLDER mas código base64, a data de assinatura pode ser provada

source: Either current file or your signature hash, and validation of match # using tsr and certificate chain
pt: Arquivo atual ou hash de sua assinatura, e validação de correspondência # usando tsr e cadeia de certificados

source: TSA certificate not found - Downloading from
es: Certificado TSA no encontrado - Descargando desde
fr: Certificat TSA introuvable - Téléchargement depuis
pt: Certificado TSA não encontrado - Baixando de

source: Failed to download TSA certificate
es: Error al descargar certificado TSA
fr: Échec du téléchargement du certificat TSA
pt: Falha ao baixar certificado TSA

source: TSA authority root certificate
es: Certificado raíz de autoridad TSA
fr: Certificat racine de l'autorité TSA
pt: Certificado raiz da autoridade TSA

source: COPY the three lines below and PASTE into file
es: COPIAR las tres líneas siguientes y PEGAR en el archivo
fr: COPIER les trois lignes suivantes et COLLER dans le fichier
pt: COPIE as três linhas abaixo e COLE no arquivo

source: or download %s to %s
es: o descargar %s a %s
fr: ou télécharger %s dans %s
pt: ou baixe %s para %s

source: show certificate details
es: mostrar detalles del certificado
fr: montrer les détails di certificat
pt: mostrar detalhes do certificado

source: Base64 encoding of TSA-validated tsr
es: Codificación base64 del tsr validado por TSA
fr: Encodage 64 du tsr validé par la TSA
pt: Codificação Base64 do tsr validado por TSA

source: show timestamp details
es: mostrar detalles del sello temporal
fr: montrer les détails de l'horodatage
pt: mostrar detalhes do carimbo

source: Untimestamped file without payload
es: Archivo sin sello temporal y sin payload
fr: Fichier non horodaté sans payload
pt: Arquivo não carimbado sem payload

source: just before timestamping
es: justo antes del sellado temporal
fr: juste avant l'horodatage
pt: pouco antes de carimbar

source: Current file hash and validation of match using tsr # and certificate chain
fr: Hash du fichier actuel et validation de la # correspondance à l'aide du tsr et de la chaîne de certificats
pt: Hash atual do arquivo e validação de correspondência usando tsr # e cadeia de certificados

source: Links your signature or file hash to the tsr date in the TSA trust chain
pt: Vincula sua assinatura ou hash do arquivo à data tsr na cadeia TSA

source: verify timestamp
es: verificar sello temporal
fr: vérifier l'horodatage
pt: verificar carimbo

source: Keep temporary directory for inspection
es: ¿Mantener directorio temporal para inspección
fr: Voulez-vous conserver le répertoire temporaire pour contrôle
pt: Manter diretório temporário para inspeção

source: is kept
es: se mantiene
fr: est conservé
pt: foi mantido

source: Key+certificate container
es: Contenedor clave+certificado
fr: Conteneur de clé+certificat
pt: Contêiner de chave+certificado

source: Certificate
es: Certificado
fr: Certificat
pt: Certificado

source: Private key
es: Clave privada
fr: Clé privée
pt: Chave privada

source: Certificate signing request
es: Solicitud de firma de certificado
fr: Demande de signature de certificat
pt: Pedido de assinatura de certificado

source: UNENCRYPTED private key
es: Clave privada SIN cifrar
fr: Clé privée NON chiffrée
pt: Chave privada NÃO CRIPTOGRAFADA

source: ENCRYPTED private key
es: Clave privada CIFRADA
fr: Clé privée chiffrée
pt: Chave privada CRIPTOGRAFADA

source: DEM file (GDAL format)
es: Archivo DEM (formato GDAL)
fr: Fichier DEM (format GDAL)
pt: Arquivo DEM (formato GDAL)

source: ERROR
fr: ERREUR
pt: ERRO

source: Missing command
es: Comando faltante
fr: Commande manquante
pt: Comando faltando

source: Links the file hash to the tsr date in the TSA trust chain
es: Vincula el hash del archivo a la fecha tsr en la cadena de confianza TSA
fr: Lie le hash du fichier à la date du tsr dans la chaîne de confiance de la TSA

source: Apply pipeline to each filename read from
es: Aplicar el pipeline a cada nombre de archivo leído desde

source: Current file hash and validation of match using tsr and certificate chain
es: Hash actual del archivo y validación de coincidencia usando tsr y cadena de certificados
